/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   so_long.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: chanwoki <chanwoki@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/27 10:42:29 by chanwoki          #+#    #+#             */
/*   Updated: 2023/01/27 11:09:41 by chanwoki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "mlx/mlx.h"

int	main(void)
{
	void	*mlx;
	void	*win;

	mlx = mlx_init();
    //소프트웨어와 디스플레이 간의 연결을 초기화하기 위해 mlx_init()을 사용
	win = mlx_new_window(mlx, 500, 500, "타이틀바 문자열");
    // 새로운 윈도우를 스크린 위에 생성해주는 함수
	mlx_loop(mlx);
    // 키보드나 마우스로부터 이벤트를 받기위해 이벤트를 수신하는 함수,
    // 이벤트를 지속적으로 받기위해 무한루프임
}
